Documents/ЕжедневноеИспользованиеРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЕжедневноеИспользованиеРесурсов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ФактическоеИспользованиеРесурсов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДоговоровПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Персонал</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Персонал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Персонал</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цех</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НочныеЧасы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыходныеПраздничные</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПричинаОтсутствия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УдалитьПричиныОтсутствия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтсутствия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныОтсутствия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Инструменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЦех</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НочныеЧасы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеФакт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоговорУслуги</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорДоходный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КодыСкладаПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КодыСкладаПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСклада</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЕжедневноеИспользованиеРесурсов/Forms/ПодборСоСклада/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КодыСкладаПользователей.КодСклада КАК КодСклада
	|ИЗ
	|	РегистрСведений.КодыСкладаПользователей КАК КодыСкладаПользователей
	|ГДЕ
	|	КодыСкладаПользователей.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		Элементы.КодСклада.СписокВыбора.Добавить(РезультатЗапроса.КодСклада);
	КонецЦикла; 
	
	Элементы.КодСклада.РежимВыбораИзСписка = Элементы.КодСклада.СписокВыбора.Количество();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	АдресТаблицыМатериалов = ПоместитьТаблицуМатериаловВоВременноеХранилище();
	Закрыть(АдресТаблицыМатериалов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМатериал(Команда)
	
	ТекущиеДанныеМатериалы = Элементы.ТаблицаМатериалов.ТекущиеДанные;
	ПоказатьЗначение( , ТекущиеДанныеМатериалы.Материал);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьМатериалы(Команда)
	
	Если Не ЗначениеЗаполнено(КодСклада) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнен код склада'"), , "КодСклада");
		Возврат;
	КонецЕсли; 
	
	ТаблицаМатериалов.Очистить();
	
	ПодобратьМатериалыНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПодготовитьПараметрыЗапросаВКУФИБ()
	
	ЛогинКонстанта  = Константы.ЛогинСервисаКладоВКУФИБ.Получить();
	ПарольКонстанта = Константы.ПарольСервисаКладоВКУФИБ.Получить();
	
	ПараметрыАутентификации = Новый Структура;
	ПараметрыАутентификации.Вставить("Тип",          "Basic");
	ПараметрыАутентификации.Вставить("Пользователь", ЛогинКонстанта);
	ПараметрыАутентификации.Вставить("Пароль",       ПарольКонстанта);
		
	СтруктураТелаЗапроса = Новый Структура;
	СтруктураТелаЗапроса.Вставить("СписокСкладов", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КодСклада));
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Аутентификация", ПараметрыАутентификации);
	СтруктураРезультат.Вставить("Таймаут",        30);
	СтруктураРезультат.Вставить("JSON",           СтруктураТелаЗапроса);

	Возврат СтруктураРезультат;
	
КонецФункции
 
&НаСервереБезКонтекста
Процедура ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки)
	
	ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("ПодборНоменклатурыЕжеднИспользованиеРесурсов",
		УровеньЖурналаРегистрации.Ошибка, 
		Метаданные.Документы.ЕжедневноеИспользованиеРесурсов,
		,
		ТекстОшибки);
	
КонецПроцедуры
 
&НаСервере
Функция ПолучитьСоответствиеКодМатериал(ТелоОтветаКУФИБ)
	
	КодыМатериалов = Новый Массив;
	
	Для каждого СтрокаТелаОтвета Из ТелоОтветаКУФИБ Цикл
		
		КодыМатериалов.Добавить(СтрокаТелаОтвета.НоменклатураКод);
		
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Материалы.Ссылка КАК Ссылка,
	|	Материалы.Код КАК Код,
	|	Материалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	Справочник.Материалы КАК Материалы
	|ГДЕ
	|	Материалы.Код В(&КодыМатериалов)";
	Запрос.УстановитьПараметр("КодыМатериалов", КодыМатериалов);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	СоответствиеРезультат = Новый Соответствие;
		
	Пока РезультатЗапроса.Следующий() Цикл
		
		СтруктураМатериала = Новый Структура("Ссылка, ЕдиницаИзмерения");
		
		ЗаполнитьЗначенияСвойств(СтруктураМатериала, РезультатЗапроса); 
		
		СоответствиеРезультат.Вставить(РезультатЗапроса.Код, СтруктураМатериала);
		
	КонецЦикла; 
	
	Возврат СоответствиеРезультат;
	
КонецФункции

&НаСервере
Функция ПоместитьТаблицуМатериаловВоВременноеХранилище()
	
	ВыбранныеМатериалы = ТаблицаМатериалов.Выгрузить(Новый Структура("Пометка", Истина));
	Возврат ПоместитьВоВременноеХранилище(ВыбранныеМатериалы);
	
КонецФункции

&НаСервере
Процедура ПодобратьМатериалыНаСервере()
	
	АдресСервисаКУФИБ = Константы.АдресСервисаКладоВКУФИБ.Получить();
	
	ПараметрыЗапросаВКУФИБ = ПодготовитьПараметрыЗапросаВКУФИБ();
	
	Попытка
		РезультатЗапросаВКУФИБ = КоннекторHTTP.Get(АдресСервисаКУФИБ, , ПараметрыЗапросаВКУФИБ);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		НСтр("ru = 'Не удалось получить данные из КУФИБ'"));
		
		ШаблонОшибки = НСтр("ru = 'Адрес сервиса: %1, пользователь: %2'");
		
		ЗаписатьОшибкуВЖурналРегистрации(
		СтрШаблон(ШаблонОшибки, АдресСервисаКУФИБ, ПараметрыЗапросаВКУФИБ.Аутентификация.Пользователь));
		
		Возврат;
	КонецПопытки;
	
	Если РезультатЗапросаВКУФИБ.КодСостояния <> 200 Тогда		
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		НСтр("ru = 'Не удалось получить данные. Возникла ошибка на стороне КУФИБ'"));
		
		ЗаписатьОшибкуВЖурналРегистрации(
		"Ошибка в КУФИБ: " + ПолучитьСтрокуИзДвоичныхДанных(РезультатЗапросаВКУФИБ.Тело, РезультатЗапросаВКУФИБ.Кодировка) + 
		"Код состояния: "  + РезультатЗапросаВКУФИБ.КодСостояния);
		
		Возврат;
	КонецЕсли;
	
	ПараметрыПреобразованияJSON = Новый Структура;
	ПараметрыПреобразованияJSON.Вставить("ПрочитатьВСоответствие",       Ложь);
	ПараметрыПреобразованияJSON.Вставить("ФорматДатыJSON",               ФорматДатыJSON.ISO);
	ПараметрыПреобразованияJSON.Вставить("ИменаСвойствСоЗначениямиДата", "Дата");
	
	ТелоОтветаКУФИБ = КоннекторHTTP.JsonВОбъект(РезультатЗапросаВКУФИБ.Тело, , ПараметрыПреобразованияJSON);
	
	СоответствиеКодМатериал = ПолучитьСоответствиеКодМатериал(ТелоОтветаКУФИБ);
	
	Для каждого СтрокаРезультата Из ТелоОтветаКУФИБ Цикл
		
		СтруктураМатериала = СоответствиеКодМатериал.Получить(СтрокаРезультата.НоменклатураКод);
		
		Если СтруктураМатериала = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		НоваяСтрокаМатериал = ТаблицаМатериалов.Добавить();
		НоваяСтрокаМатериал.Количество       = СтрокаРезультата.Количество;
		НоваяСтрокаМатериал.Сумма            = СтрокаРезультата.Сумма;
		НоваяСтрокаМатериал.Материал         = СтруктураМатериала.Ссылка;
		НоваяСтрокаМатериал.КодМатериала     = СтрокаРезультата.НоменклатураКод;
		НоваяСтрокаМатериал.Дата             = СтрокаРезультата.Дата;
		НоваяСтрокаМатериал.ЕдиницаИзмерения = СтруктураМатериала.ЕдиницаИзмерения;

		
		Если ЗначениеЗаполнено(НоваяСтрокаМатериал.Количество) Тогда
			НоваяСтрокаМатериал.Цена = НоваяСтрокаМатериал.Сумма / НоваяСтрокаМатериал.Количество;
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры
 
#КонецОбласти
